# 2) დაწერეთ რა არის ფუნქცია, რისთვის ვიყენებთ,
# რამდენი ტიპის არსებობს, რა არის პარამეტრები, არგუმენტები 
# და დაბრუნება (return). დაწერეთ რა არის მაღალი
# იერარქიის ფუნქცია, წმინდა და არაწმინდა ფუნქცია




# ფუნქციის დახმარებით ჩვენ შეგვიძლია მრავალი მოქმედების გაკეთება ფუნქჩიის ბევრჯერ გამოძახებით
# ფუნქციებს ჩვენ გადავცემთ პარამეტრებს და შემდეგ ამ პარამეტრებს შეგვიძლია მივცეთ მნიშვნელობები
# წმინდა ფუნქცია არის როცა ფუნქციას ყოველთვის ერთიდაიგიგვე შედეგი მოაქვს ყველა ჯერზე როცა გავუშვებთ
# ხოლო არაწმინდა პირიქით