# 1) გააკეთეთ 1 მაგალითი თითოეულ ტიპის error-ზე და კომენტარებით დაწერეთ როდის ეშვება კონკრეტული error



# SyntaxError - არის როცა არის შეცდომა სინტაქსში მაგალითად აკლია ფრჩხილი და ასე შემდეგ
# ValueError - არის ერორი როცა ცვლადების სახელები განსხვავებულია
# IndexError - როცა ინდექსი არ არის სიაში
# TypeError - როცა მაგალითად სტრინგ ვაერთებთ ინტეგერთან
# ZeroDivisonError - როცა რიცხვს ვყოფთ ნულზე


name = "saba"
print(name)




name1 = "nika"
print(name1)


list = [1,2,3]
print(list[10])

print("saba" + 5)

print(10 / 0)


