#  5. შექმენით 4 სხვადასხვა list-ი, თითოში დაამატეთ მინიმუმ 10 ელემენტი და დაპრინტეთ:
# 1) პირველ list-ის პირველიდან მეოთხე ელემენტამდე ცვლადები.
#  2) მეორე list-ის მეოთხედან მერვე ელემენტამდე ცვლადები ფორ ციკლის          გამოყენებით.
#  3) მესამე list-ის მეცხრედან მეექვსე ელემენტამდე ცვლადები გაითვალისწინეთ არა 6დან 9მდე არამედ 9დან 6მდე გამოიყენეთ უარყოფითი რიცხვები.
#  4) მეოთხე list-ში დაპრინტეთ მისი ყველა ცვლადი while ცოკლის გამოყენებით.


list = [1,2,3,4,5,6,7,8,9,10]
shopping_cart = ["pinnaple","banana","pizza","water","potato","snickers" "cola","fanta","beer","nutela"]
nums = [11,12,13,14,15,16,17,18,19,20]
nums2 = [21,22,23,24,25,26,27,28,29,30]


print(list[:5])
print(shopping_cart[4:8])
print(nums[9:6])
print(nums2)
