// 3) ახსენით როგორ მუშაობს თითოეული მეთოდი და შეასრულეთ 3 მაგალითი (push,pop,unshift,shift, slice, splice)

nums = [1,2,3,4,5,6,7,8,9,10]

nums.push(11) // ამარტებს მითითითებულ ელემენტს სიაში
nums.pop() // შლის სიის ბოლო ელემენტს 
nums.unshift(0) // ამატებს ახალ ელემენტს სიის დასაწყისში
nums.shift() // შლის სიის პირველ ელემენტს
nums.slice(1,6) // გამოაქვს სია პირველი ინდექსიდან მეექვსე ინდექსამდე (რასაც მივუთითებთ ფრჩხილებში)
nums.splice(1,6) // შლის ელემენტებს 1 დან 6 მდე (რასაც მივუთითებთ ფრჩხილებში)

