# 4) ლუიზა დარბაიძემ იყიდა 2 ბაკალი  ლუდი ნუგზარი ჩუბინიძსითვის და ამის
# თაობაზე ბატნმა ნუგაზრმა განაცხადა რომ არ მეყოფა ამდენი ლუდიო 
# უნდა დავუძხო მეზობელსაც და ეღთად დავლითო 
# input ის გამოოტენებით შეეკითხეთ მომხამრებელს რამდენი ლუდი ბოთლი მოითხოვა ნუზარმა 
# რამდენსაც მოითხოვდა იმდენი ლუდის file  შექმენით და დააწერეთ თით ფაილს
# ludi 1 , ludi 2 და ასე შემდეგ



user = int(input("შეიყვანე ლუდის რაოდენობა"))

for i in user:
    file = f"file_{i}.txt" 
    
    with open(file, 'w') as f:
        f.write(f"file1 {file}\n") 
        f.write("file1.\n")
