# 1) შექმენით ფუნქცია რომელიც იღებს ერთ არგუმენტს
#  და აბრუნებს მის კვადრატს, შემდეგ გააკეთეთ
#  იგივე უკვე lambda გამოსახულების მეშვეობით
#  და გამოიძახეთ. ასევე შექმენით ფუნქცია რომელიც 
# მიიღებს სახელს და დააბრუნებს "Hello <სახელი>"
#  ასევე გააკეთეთ იგივე lambda ფუნქციით. გამოიძახეთ
#  ყველა ფუნქცია შექმნის შემდეგ და დაბეჭდეთ მათ
#  მიერ დაბრუნებული 
# შედეგები. ასევე კომენტარებით ახსენით რა არის
#  lambda ფუნქცია, რისთვის და როგორ ვიყენებთ 


def multiply(number):
    print(number * number)


multiply(10)


num = (lambda number: number * number)(10)

print(num)

def Hello(name):
    print(f"hello {name}")
Hello("saba")

name = (lambda name: print(f"hello {name}")) ("saba")
print(num)

# lambda ფუნქცია არის ფუნქციის დაწერის ერთერთი ხერხი როგორც def მაგრამ ლამბდა ფუნქციის დაწერა უფრო სწრაფად და
# მარტივად შეილძლე lambda-ს ძირითადად იყენებენ პატარა ფუნქციების დასაწერად