// შექმენით მარტივი ტემპერატურის გადამყვანი, რომელიც მომხმარებელს საშუალებას მისცემს შეიყვანოს ტემპერატურა ცელსიუსში და მიიღოს შედეგი ფარენჰეიტში. 

// გამოიყენეთ input ელემენტი, სადაც მომხმარებელი შეიტანს რიცხვს, ამ შესაყვანი ველის გვერდზე გქონდეთ ღილაკი,

//  სადაც გამოიყენებთ onclick-ს, გამოთვლის ფუნქციის მისაბმელად.

// გადაყვანის ფორმულაა: ფარენჰეიტი = (ცელსიუსი × 9/5) + 32. 

// გამოიყენეთ document.getElementById input ველის მნიშვნელობის მისაღებად, შედეგის გამოსატანად ასევე დაგჭირდებათ .innerText.



const user = document.getElementById("input")
const result = document.getElementById("result")
function changeTemp(){
    result.textContent = (user.value * 9/5) + 32
}