# 2) ყველა დავალება შეასრულეთ ჯერ სტანდარტული ფორმით,
#  შემდეგ კი შემოკლებული გზით. 1. შექმენით სია რომელშიც
#  იქნება 0-იდან 21-მდე რიცხვები. 2. აიღეთ სია რომელშიც 
# იქნება რიცხვების კვადრატები (თავის თავზე ნამრავლი) 1-იდან
#  10-მდე 3. შექმენით რიცხვების სია რომელშიც დაამატებთ ლუწ
#  რიცხვებს 20-იდან 40-მმდე 4. შექმენით 1 რიცხვების სია, შემდეგ 
# მორე რომელშიც გადაიტანთ მხოლოდ კენტ რიცხვებს პირბელი სიიან
#  და გაამრავლებთ ორზე



nums = [num for num in range(1,21)]

for i in range(1,21):
    nums.append(i)
print(nums)

squares = []
for i in range(1,11):
    squares.append(i*i)
print(squares)


numbers = [1,2,32,43,65,76,32,42123,56,32]
odd_numbers = []
even_numbers = []

for i in numbers:
    if i % 2 == 0:
        even_numbers.append(i)
    else:
        odd_numbers.append(i)


