# 5) ულვაშებიანმა ზღვის ლომმა დაითვალა თავისი ულვაშების ღერები რაოდენობა ოღნდ როცა დაითვლიდა ამ ულვაშების რაოდენობას
# ავაიყდებოდა ხოლმე შედაბამისად თავიდან იწყებდა ხოლმე ულვაშების ღერების დათვლას

# wile loop ის გამოყენებით შექმენით იმდენი ფალი რამდნსაც ითვლიდა ეს ჩვენი ზღვის ლომი

# ასევე input გამოყენეთ რომ გივთხარს ყოველ ჯერზე რამდენი დათვალა ასევე 20 თუ გდაცდებოდა ულვაშების ღერების რაოდენობა 
# მშინ  while loop გაჩერდებდ და დაწერს ტერმინშლი როპმ მაგდენი ულვაში ღერი არ აქვს ზღვის ლომს




mustache = 200



for i in mustache:
    file = f"file_{i}.txt" 
    
    with open(file, 'w') as f:
        f.write(f"This is content for {file}\n") 
        f.write("This is a second line.\n")
