# 3) შექმენით 2 set, რომლებშიც შეინახავთ სხვადასხვა რიცხვებს 
# (ორივე სიმრავლეში აიღეთ გასნხვავებული და იგივე ელემენტები
#  ასევე განმეორებადი ელემენტები) გამოიყენეთ add და remove მეთოდები 
# ორივე set-ზე, შემდეგ ამ ორ set-ს შორის განახორციელეთ ოპერაციები:
#  union, intersection და difference


nums1 = {1,2,3,4,5,6,7,8,9,10}
nums2 = {1,3,7,3,25,66,23,88,8}

nums1.add(50)
nums2.add(200)
nums1.remove(2)
nums1.remove(88)

print(nums1.union(nums2))
print(nums1.intersection(nums2))
print(nums1.difference(nums2))


# list-ში შეგვიძლია მრავალი ინფორმაციის შენახვა და შებვიძლია მასში ელემენტების დამატება ამოღეება შეგვიძლია გამოვიყენოთ slicing-ი
# indexინგიდა ა.შ 
# თაფლში შეგვიძლია გამოვიყენოთ ინდექსინგი და სლაისინგი ასევე შეგვიძლია დავსორტოთ ელემენტები მაგარამ არ შეგვიძილია ელემენტების 
# დამატება და ამოღება
# სეტში არ შეგვიძლია გამოვიყენოთ სორტირება ინდექსინგი სლაისინგი მაგრამ შეგვიძლია ელემენტების დამატება და ამოღება


